content/teaching/mat8030-2024F/index.md
+++
title = "MAT8030 Advanced Probability, 2024 Fall"
draft = false
+++

## Course Information {#course-information}

-   Time: Mon 7-10 pm
-   Location: 三教 107
-   Office hour: M622, Mon 4-6 pm or by appointment
-   TA: 樊泽腾 (fanzet at hotmail dot com)


## Lecture note {#lecture-note}

[lecture note](./adv-prob-note.pdf) (updated up to lect 8)

hand-written draft notes

| date  | file                   |
|-------|------------------------|
| 9/14  | [lect 2](./lect2.pdf)  |
| 9/23  | [lect 3](./lect3.pdf)  |
| 9/30  | [lect 4](./lect4.pdf)  |
| 10/14 | [lect 5](./lect5.pdf)  |
| 10/21 | [lect 6](./lect6.pdf)  |
| 10/28 | [lect 7](./lect07.pdf) |
| 11/4  | [lect 8](./lect08.pdf) |


## references {#references}

-   Durrett, Richard. _Probability: Theory and Examples (Fifth edition)_. Cambridge Series in Statistical and Probabilistic Mathematics 49. Cambridge ; New York, NY: Cambridge University Press, 2019. [Copy from Durrett's homepage](https://services.math.duke.edu/%7Ertd/PTE/PTE5_011119.pdf)
-   Chung, Kai Lai. _A Course in Probability Theory (Third edition)_. San Diego, Calif.: Academic Press, 2007.
-   Billingsley, Patrick. _Convergence of Probability Measures (2nd edition)_. Wiley Series in Probability and Statistics. Probability and Statistics. New York: Wiley, 1999.
-   Kolmogorov, A.N. _Foundations of the Theory of Probability (English Translation)_. Edited by Nathan Morrison. 1st ed., 1933. [PDF copy](./Kolmogorov1933.pdf)
-   Shiryaev, A. N. _Probability_. Vol. 95. Graduate Texts in Mathematics. New York, NY: Springer New York, 1996. [Copy from Springer](https://doi.org/10.1007/978-1-4757-2539-1).


## HW {#hw}

-   weekly; posted usually by Wednesday, due next Monday before class.
-   Discussion and collaboration are encouraged, but names of the collaborators should be given in the submitted work.

| Assignments      | Due date | Solution |
|------------------|----------|----------|
| [HW1](./hw1.pdf) | 9/23     |          |
| [HW2](./hw2.pdf) | 9/30     |          |
| [HW3](./hw3.pdf) | 10/14    |          |
| [HW4](./hw4.pdf) | 10/21    |          |
| [HW5](./hw5.pdf) | 10/28    |          |
| [HW6](./hw6.pdf) | 11/11    |          |


## Grading scheme {#grading-scheme}

|                | %   |        |
|----------------|-----|--------|
| HW assignments | 40% | weekly |
| Final          | 60% |        |


## Schedule (tentative) {#schedule--tentative}

-   **Measure theory preliminaries (weeks 1-2)**: properties of measures, probability spaces;  sigma-algebras, monotone class theorem, principle of appropriate sets; distribution functions, construction of measures, Carathéodory's extension theorem; decomposition of distribution functions, singular and absolute continuity, singular measures, Cantor set and function.
-   **Random variables and integration (week 2)**: measurable maps, random variables and vectors, Borel measurability; simple functions, expectation of random variables; monotone/dominated/bounded convergence theorems, Fatou's lemma; change of variables.
-   **Mode of convergence (week 3)**: almost sure convergence, convergence in probability, convergence in Lp, convergence in distribution; first Borel--Cantelli lemma; uniform integrability.
-   **Independence and product measures (week 4)**: independence of r.v.'s, independence of sigma-algebras; product measures, Fubini's theorem, cross-section, Fubini on complete measure spaces; Kolmogorov's extension theorem, cylinder sets, consistency condition, iid r.v.'s.
-   **Law of large numbers (weeks 5-6)**: uncorrelated r.v.'s, Chebyshev's inequality, L2 LLN; weak LLN, convergence of  triangular arrays; second Borel--Cantelli lemma, strong LLN, tail sigma-algebras, Kolmogorov's 0-1 law, Kolmogorov's three-series theorem.
-   **Central Limit Theorem (weeks 7-8)**: weak convergence; characteristic functions and inversion formula; Levy's continuity Theorem; Lindeburg's condition; stable laws and infinitely divisible distributions
-   **Discrete martingales (weeks 9-10)**: conditional expectations; Doob's inequalities, uniformly integrable martingales, down-crossing inequality and a.s. convergence; stopping times, optional sampling theorem
-   **Markov chains (weeks 11-12)**: random walks, zero-one law, recurrence; stationary measures; strong Markov property.
-   **Ergodic Theorems (week 13)**: measure preserving map, invariant sets; invariant measure, ergodic measure; Birkhoff's Ergodic Theorem; subadditive ergodic theorem.
-   **Functional CLT (week 14)**: measures on metric spaces, weak convergence; Brownian motions; Donsker's invariance principle; CLT for martingales; CLT for stationary sequences; mixing.
-   **Other topics and review (weeks 15-16)**: regular conditional expectation; renewal process
